import pandas as pd
df = pd.read_csv('address_book.csv', index_col=0, sep=',')              #считываем нашу таблицу

# df = pd.DataFrame({
#     'ФИО': ['Иванов Иван Иванович', 'Олегов Олег Олегович', 'Макчимов Максим Максимович'],
#     'Адрес': ['г.Минск','г.Витебск','г.Жодино'],
#     'Телефон': ['+375 29 324 56 67', '+375 29 851 28 58', '+375 29 635 28 18'],
#     'Дата рождения': ['30.06.2006', '28.08.1999', '24.05.2021']
# })
# df.index.name = 'Номер по счёту'
print(df)

n = input("\nДобрый день!\n Введите 1 если хотите добавить человека:\n Введите 2 если хотите удалить кого-то\n Введите 3 если хотите изменить запись в адресной книге\n Введите 4 если хотите завершить программу\n")
flag = True         #для выхода из циккла и остановки программы

while flag is True:
    if n == '4':                                        #если нажали 4 то тогда сохраняем таблицу и останавливаем программу
        print("Спасибо за работу! Ваша таблица сохранена :)")
        df.to_csv('address_book.csv')           #сохраняем нашу табличку в файлик
        flag = False
        break

    elif n == '1':                                  #если нажали 1 то добавляем новую строку с данными в нашу таблицу
        fio = input("Введите ФИО ")
        adres = input("Введите адрес ")
        telefon = input("Введите телефон ")
        date = input("Введите дату ")
        df_new = pd.DataFrame({
            'ФИО': [fio],
            'Адрес': [adres],
            'Телефон': [telefon],
            'Дата рождения': [date]
        })
        df = pd.concat([df, df_new], ignore_index=True)             #объединяем новую таблицу со старой
        n = input(f'Обновлённая таблица:\n\n{df}\n\nВведите следующую команду для работы(*1,2,3,4) ')

    elif n == '2':                                    #если нажали 2 то удаляем выбраную строку
        x = int(input("\nВведите строку которую вы хотите удалить\n"))
        df.drop(x, inplace=True)                #удаляем выбраную строку
        n = input(f'Обновлённая таблица:\n\n{df}\n\nВведите следующую команду для работы(*1,2,3,4) ')

    elif n == '3':                                      #если нажали 3 то заменяем выброную строку на новые данные
        y = int(input("\nВведите строку кооторую вы хотите заменить "))
        fio2 = input("Введите ФИО ")
        adres2 = input("Введите адрес ")
        telefon2 = input("Введите телефон ")
        date2 = input("Введите дату ")
        df.loc[y] = [fio2, adres2, telefon2, date2]   #замена строки y на новые данные
        n = input(f'Обновлённая таблица:\n\n{df}\n\nВведите следующую команду для работы(*1,2,3,4) ')



