import pandas as pd

df = pd.DataFrame({
    'ФИО': ['Иванов Иван Иванович', 'Олегов Олег Олегович', 'Макчимов Максим Максимович'],
    'Адрес': ['г.Минск','г.Витебск','г.Жодино'],
    'Телефон': ['+375 29 324 56 67', '+375 29 851 28 58', '+375 29 635 28 18'],
    'Дата рождения': ['30.06.2006', '28.08.1999', '24.05.2021']
})
df.index.name = 'Номер по счёту'
print(df)

n = input("\nДобрый день!\n Введите 1 если хотите добавить человека:\n Введите 2 если хотите удалить кого-то\n Введите 3 если хотите изменить запись в адресной книге\n Если хотите завершить программу нажмите 4\n")
if n == 1:
    fio = input("\n Введите ФИО")
    adres = input("\n Введите адрес")
    telefon = input("\n Введите телефон")
    date = input("\n Введите дату")
    df_new = pd.DataFrame({
        'ФИО': [fio],
        'Адрес': [adres],
        'Телефон': [telefon],
        'Дата рождения': [date]
    })
    df = pd.concat([df, df_new], ignore_index=True)

elif n == 2:
    x = input("\nВведите строку которую вы хотите удалить\n")
    df.drop(x, inplace=True)

elif n == 3:
    y = input("\nВведите строку кооторую вы хотите заменить и введите новые данные\n")
    df.loc[y] = []



